# 라이브러리 및 데이터 불러오기

In [2]:
import os
import numpy as np
import pandas as pd

import seaborn as sns
import matplotlib.pyplot as plt

# 3. 데이터전처리

#### 3-1) 데이터 불러오기

In [5]:
os.getcwd()

'C:\\Users\\dmlql\\KT_AIVLE\\Kaggle\\2024.05_Titanic'

In [6]:
train_data = pd.read_csv('./data/train.csv')
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [35]:
df = train_data.copy()

#### 3-2) feature 추가
* Mr, Mrs 등 호칭 정리

In [36]:
# 이름에서 호칭만 추출
df['Title'] = [name.split(', ')[1].split()[0][:-1] for name in df['Name']]
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr

#### 3-3) 필요 없는 열 제거
* PassengerId, Name, Ticket, Cabin

In [37]:
del_cols = ['PassengerId', 'Name', 'Ticket', 'Cabin']
df = df.drop(columns = del_cols)
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked Title
0         0       3    male  22.0      1      0   7.2500        S    Mr
1         1       1  female  38.0      1      0  71.2833        C   Mrs
2         1       3  female  26.0      0      0   7.9250        S  Miss
3         1       1  female  35.0      1      0  53.1000        S   Mrs
4         0       3    male  35.0      0      0   8.0500        S    Mr

#### 3-4) 결측치 처리

In [9]:
df.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [38]:
df2 = df.dropna()
df2.isna().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
Title       0
dtype: int64

#### 3-5) 가변수화
* Pclass, Sex, SibSp, Parch, Embarked, Title

In [41]:
sel_cols = ['Pclass', 'Sex', 'SibSp', 'Parch', 'Embarked', 'Title']
df3 = pd.get_dummies(df2, columns=sel_cols, drop_first=True)
df3.head()

,Survived,Age,Fare,Pclass_2,Pclass_3,Sex_male,SibSp_1,SibSp_2,SibSp_3,SibSp_4,...,Title_Master,Title_Miss,Title_Mlle,Title_Mme,Title_Mr,Title_Mrs,Title_Ms,Title_Rev,Title_Sir,Title_th
0,0,22.0,7.2500,False,True,True,True,False,False,False,...,False,False,False,False,True,False,False,False,False,False
1,1,38.0,71.2833,False,False,False,True,False,False,False,...,False,False,False,False,False,True,False,False,False,False
2,1,26.0,7.9250,False,True,False,False,False,False,False,...,False,True,False,False,False,False,False,False,False,False
3,1,35.0,53.1000,False,False,False,True,False,False,False,...,False,False,False,False,False,True,False,False,False,False
4,0,35.0,8.0500,False,True,True,False,False,False,False,...,False,False,False,False,True,False,False,False,False,False

#### 3-6) 데이터 분리

In [43]:
from sklearn.model_selection import train_test_split
dataset = df3.copy()

target = 'Survived'
X = dataset.drop(target, axis=1)
y = dataset.loc[:, target]

X_train, X_val, y_train, y_val = train_test_split(X, y, test_size=0.2, random_state=2024, stratify = y)
X_train.shape, X_val.shape, y_train.shape, y_val.shape

((569, 34), (143, 34), (569,), (143,))

# 4. Base Modeling

#### 4-1) 라이브러리 불러오기

In [ ]:
import sklearn.linear_models import LogisticRegression()
import sklearn.keras.neigbors import KNeighborClassifier